app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "projects".* FROM "projects"
---
  def index
    @users = User.all
    @projects = Project.all

    # Set @user only if needed for the view (e.g., for adding projects)
    @user = User.first  # Or dynamically set based on some other logic