app/views/layouts/application.html.erb

            <%= form.label :user_id, "Assign User", class: "form-label" %>
            <%= form.collection_select :user_id, User.all, :id, :name, { prompt: "Select a user" }, class: "form-control" %>
---
SELECT "users".* FROM "users"